Revit 2024 API
LineLoad.GetCurve Method
 Returns curve that define geometry of the line load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public Curve GetCurve()
Visual Basic
Public Function GetCurve As Curve
Visual C++
public:
Curve^ GetCurve()
See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace